import React from 'react'
import s from './FAQ.module.scss'
//types 
import { FAQItemType } from '../../types/types'
import FAQItem from '../FAQ/FAQItem'
import forest from '../../img/FAQ/Forest.png'


function FAQ() {

    const FAQItems: FAQItemType[] = [
        {
            id: 1,
            question: 'Чи можна оплатити товар при отриманні?',
            answer: "Оплатити товар при отриманні можна, але при такому способі ми просимо передоплату у 100 гривень якщо вартість замовлення до 1000грн, за замовлення від 1000грн передоплата 30-50% а залишкову вартість Вашого замовлення Ви оплачуєте безпосередньо при отриманні на складі кур'єрської служби.",
        },
        {
            id: 2,
            question: 'Як правильно підібрати розмір?',
            answer: "Для найбільш точного підбору розміру одягу та/або розміру взуття необхідно заміряти обхват грудей і/або талії і/чи довжину стопи в сантиметрах і порівняти отримане значення з відповідною таблицей розмірів на сайті. Детальніше: https://bemoda.com.ua/ua/company_faq",
        },
        {
            id: 3,
            question: 'Для чого потрібна передоплата?',
            answer: "Передоплата береться на випадок відмови або не забору Вами посилки зі складу кур'єрської служби. Так як подібні випадки мали місце і нам щоб забрати товар назад потрібно було оплачувати доставку туди і назад – ми змушені були ввести обов'язковою умовою передоплату у 100 гривень перед відправкою товару.",
        },
        {
            id: 4,
            question: 'Як я можу бути впевнений що оплачуючи замовлення наперед Ви вишліть моє замовлення?',
            answer: "Ми працюємо офіційно, чесно і підтверджуємо це юридично, ознайомтесь будь ласка з договором офертою. У нас також є всі потрібні дозвільні документи, при бажанні ми можемо надати їх Вам. Крім цього кожен рахунок Приватбанку або інною інший рахунок у банку, на який Ви будете здійснювати оплату замовлень, прив'язаний до конкретної людини. При будь-якому виді шахрайства в інтернеті ― просто звертайтеся в поліцію. За номером рахунку швидко знайдуть відповідальної людини.І найголовніше, будь ласка задумайтеся, чи будемо ми з- за одного замовлення втрачати власну справу, репутацію, напрацьовану вже не третій рік.Відповідь однозначна ― 'ні, звичайно'.Це як мінімум нерозумно, інтернет магазин – це великі капіталовкладення, розробка, наповнення, закупівля товару, персонал, реклама та інше.",
        },
    ]

    // const [active, setActive] = React.useState<null | number>(null)

    // const changeActive = (id: number) => {
    //     setActive(id)
    // }

    return (
        <div className={s.wrapper}>
            
            <div className={s.wrap}>
            <div className={s.transition}></div>

            <div className={s.faq__wrapper}>
                <div className={s.title}>FAQ</div>
                {FAQItems.map((obj) => {
                        return <FAQItem key={obj.id} obj={obj} />
                    })}
            </div>
            </div>

        </div>
    )
}

export default FAQ